Trial2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    Top
    {
        type            patch;
        nFaces          80;
        startFace       5420;
    }
    Bottom
    {
        type            patch;
        nFaces          40;
        startFace       5500;
    }
    Left
    {
        type            patch;
        nFaces          30;
        startFace       5540;
    }
    Right
    {
        type            patch;
        nFaces          30;
        startFace       5570;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          5660;
        startFace       5600;
    }
    Lower
    {
        type            wall;
        inGroups        1(wall);
        nFaces          40;
        startFace       11260;
    }
    Upper
    {
        type            wall;
        inGroups        1(wall);
        nFaces          40;
        startFace       11300;
    }
)

// ************************************************************************* //
