Trial2/system/heatSource/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains  4;

//- Keep owner and neighbour on same processor for faces in zones:
// preserveFaceZones (heater solid1 solid3);

//method          scotch;

// method          hierarchical;
// method          simple;
// method          manual;

regions
{
    solid
    {
        numberOfSubdomains  1;
        method          simple; // none;

        coeffs
        {
            n       (1 1 1);
        }
    }
}

/*coeffs
{
    n       (2 2 1);
}*/

// ************************************************************************* //
